app/controllers/tasks_controller.rb

  def show
    id = params[:id].to_i
    @task = Task.find_by(id: id)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def edit
    @task = Task.find(params[:id].to_i)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @task = Task.new(task_params)

    if @task.save # save returns true if the database insert succeeds
---
INSERT INTO "tasks" ("category", "name", "due", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["category", "School"], ["name", "Finish work"], ["due", "today"], ["created_at", "2018-09-24 04:23:13.813138"], ["updated_at", "2018-09-24 04:23:13.813138"]]

    task = Task.find_by(id: params[:id].to_i)
    task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "name" = $1, "category" = $2, "due" = $3, "updated_at" = $4 WHERE "tasks"."id" = $5  [["name", "Finish work"], ["category", "School"], ["due", "today"], ["updated_at", "2018-09-24 04:19:31.893267"], ["id", 22]]

    task = Task.find_by(id: params[:id].to_i)
    @deleted_task = task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 5]]

  def complete
    @task = Task.find(params[:id].to_i)
    @task.update_attribute(:completed_on, Time.now)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
UPDATE "tasks" SET "completed_on" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed_on", "2018-09-24 18:05:18.279123"], ["updated_at", "2018-09-24 18:05:18.279635"], ["id", 40]]